---
kind: type
id: T:Autodesk.Revit.DB.TriangulationInterface
source: html/52c77543-3282-78a8-6a57-dd245b2090c4.htm
---
# Autodesk.Revit.DB.TriangulationInterface

This abstract class provides an interface for querying a triangulation structure (vertices and triangles).

## Syntax (C#)
```csharp
public class TriangulationInterface : IDisposable
```